
# Series

In [40]:
import numpy as np

In [41]:
import pandas as pd

In [42]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c': 30}

In [43]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [44]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [45]:
pd.Series(d)    # Pandas will take keys of dicrionaries as index and value as data

a    10
b    20
c    30
dtype: int64

In [46]:
pd.Series(labels)    # Series can hold anytype of data types

0    a
1    b
2    c
dtype: object

Pandas Series can hold any objecs as its data type.

In [47]:
ser1 = pd.Series([1,2,3,4], ['USA','Germany','UK','France'])

In [48]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Spain','France'])

In [49]:
ser1

USA        1
Germany    2
UK         3
France     4
dtype: int64

In [50]:
ser2

USA        1
Germany    2
Spain      5
France     4
dtype: int64

In [51]:
ser1['USA']

1

In [52]:
ser2['Spain']

5

In [53]:
ser1 + ser2   # Pandas will always return he result of operaion in FLoat values

France     8.0
Germany    4.0
Spain      NaN
UK         NaN
USA        2.0
dtype: float64


# Data frames

In [54]:
import numpy as np
import pandas as pd

In [55]:
np.random.seed(101)

In [56]:
df = pd.DataFrame(np.random.randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])

In [57]:
df    # DataFrame is a bunch of series with common index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Selecting Col from DataFrame

In [58]:
df['W']   # Or we can column by df.w

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [59]:
df[['W','Z']]    # Double bracket is used to select more than one column from data frame

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

Adding new Col in Data Frame

In [60]:
df['New'] = df['W'] + df['Y']

In [61]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

Droping Col or row from Data Frame

In [62]:
df.drop('New',axis=1,inplace=True)     

# Func to delet/drop the coloumn/row from the datafram
# for Coloumn axis=1 and for row axis is by default 0
# By default Inplace is False, so that we can remove any data from DF mistakenly. If you wnat to remove then Inplace =  True
# 0 and 1 in axis are index of tuple denoting the shape of DF

In [63]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Selection Row from Data frame

In [64]:
df.loc['D']   # method to select a particular row. Take Label as argument

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [65]:
df.iloc[3]   # TO select particular row. Take Index location as argument

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [66]:
df.loc['A','Y']   # TO select a particula cell value from the date frame

0.9079694464765431

In [67]:
df.loc[['A','D'],['X','Z']]    # To select a sub-set from the exisiting data frame

          X         Z
A  0.628133  0.503826
D -0.758872  0.955057





Conditional Selection

In [68]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
booldf = df > 0

In [70]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [71]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
# we can perform the above steps in one single step

df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [74]:
df[df['W']>0]   # Conditional Seletion in dataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [76]:
df[df['W']>0][['X','Y']]    # Selecting the particular series from the conditional selection DF

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [77]:
# Multiple parameters in conditional selection
# And : &
# Or : |

df[(df['W']>0) & (df['Y']<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

Reseting the Index

In [78]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [79]:
df.reset_index()    # Reseting the index. It does not occured in place untill user change Inplace = True

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [80]:
# Assigning the new Index

In [81]:
newlst = 'Raj NDLS MHA KAR PUN'.split()

In [82]:
newlst

['Raj', 'NDLS', 'MHA', 'KAR', 'PUN']

In [83]:
df['States'] = newlst

In [84]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826    Raj
B  0.651118 -0.319318 -0.848077  0.605965   NDLS
C -2.018168  0.740122  0.528813 -0.589001    MHA
D  0.188695 -0.758872 -0.933237  0.955057    KAR
E  0.190794  1.978757  2.605967  0.683509    PUN

In [85]:
df.set_index('States')   # Assigning the col as new index. It is also not Inplace untill user assign Inplace=True

               W         X         Y         Z
States
Raj     2.706850  0.628133  0.907969  0.503826
NDLS    0.651118 -0.319318 -0.848077  0.605965
MHA    -2.018168  0.740122  0.528813 -0.589001
KAR     0.188695 -0.758872 -0.933237  0.955057
PUN     0.190794  1.978757  2.605967  0.683509

In [86]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826    Raj
B  0.651118 -0.319318 -0.848077  0.605965   NDLS
C -2.018168  0.740122  0.528813 -0.589001    MHA
D  0.188695 -0.758872 -0.933237  0.955057    KAR
E  0.190794  1.978757  2.605967  0.683509    PUN

#

Multi Level Index Data Frames

In [87]:
# Creating a Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [88]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [89]:
# Creating a multilevel dataframe

df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [90]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [91]:
# Indexing the multilevel Dataframe

df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [92]:
# Naming the Index

df.index.names = ['Groups','Num']

In [93]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [94]:
df.loc['G2'].loc[3]['B']    # Callind the value in multilevel Dataframe

0.32964629880452445

In [95]:
# Cross section func, to call the specific value at the cross section

df.xs(2,level='Num')

               A         B
Groups
G1     -1.706086 -1.159119
G2      0.807706  0.072960

# Missing Data

In [96]:
d = {'A': [1,2,np.nan], 'B':[3,np.nan,np.nan], 'C':[4,5,6]}

In [97]:
df1 = pd.DataFrame(d)

In [98]:
df1

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [99]:
df1.dropna()   # Will drop any row which have Null or NA value. FOr column axis = 1

     A    B  C
0  1.0  3.0  4

In [100]:
df1.dropna(axis=1)

   C
0  4
1  5
2  6

In [101]:
df1.dropna(thresh=2)   # Thresh = 2, it will keep the rows with min 2 non NA value

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5

In [102]:
# to fill the missing or NA value

df1.fillna(value='Fill Value')

            A           B  C
0           1           3  4
1           2  Fill Value  5
2  Fill Value  Fill Value  6

In [103]:
df1['A'].fillna(df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [104]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [105]:
df3 = pd.DataFrame(data)

In [106]:
df3

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [107]:
# Groupby the Company column
bycomp = df3.groupby('Company')

In [108]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [109]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [110]:
bycomp.sum().loc['MSFT']

Sales    464
Name: MSFT, dtype: int64

In [111]:
# we can call all these steps in on line

df3.groupby('Company').mean().loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [112]:
# Count the no of instances

df3.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [113]:
df3.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [114]:
# Groupby is used with describe method to get the series of information for the group

df3.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [1]:
df3.groupby('Company').describe().transpose()

NameError: name 'df3' is not defined

# Merge, Joining and Concatenating

In [116]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [117]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [118]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [119]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [120]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [121]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11




Concatination

In [122]:
pd.concat([df1,df2,df3])   # Concatinate along the row

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [123]:
pd.concat([df1,df2,df3],axis=1)    # Concatinate alog the column

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

Merging

In [124]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [125]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [126]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [127]:
pd.merge(left,right,on='key')    # Merge the two dataframe on the Key column

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [128]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [129]:
# Merging the data frame with more than 1 key

pd.merge(left,right, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [130]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [131]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [132]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

Joining

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [133]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [135]:
left.join(right)   # Join the left with right datafram along the Index

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [136]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Pandas Operations

In [137]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [139]:
# TO find the unique value and no of unique values

df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [141]:
df['col2'].nunique()

3

In [142]:
# to find the no of time the each unique value appear in the column

df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [143]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [144]:
def numsqr(x):
    return x**2

In [145]:
# Apply method is used to apply built in or custom func to the dateframe

df['col1'].apply(numsqr)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [146]:
# we can alos apply built in method

df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [147]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [148]:
# To remove a column

df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [149]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [151]:
df.sort_values('col2')    # Sorting the dataframe by particular column

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [152]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [153]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [154]:
df.fillna('Fill')

   col1  col2 col3
0     1  Fill  abc
1     2   555  def
2     3   666  ghi
3  Fill   444  xyz

Pivot Table

In [155]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [157]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [163]:
pwd

'C:\\Users\\Asus\\Desktop\\Deepak\\Code\\DS & ML Bootcamp'

In [164]:
pd.read_csv('Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [165]:
df_1 = pd.read_csv('Salaries.csv')

In [166]:
df_1

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [169]:
df_1.to_csv('My_Output', index = False)    # Saving a file to CSV format

In [170]:
pd.read_csv('My_Output')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [ ]:
#pd.read_excel("File Name",sheetname=sheet1)

In [171]:
#pd.to_excel('File Name', Sheet_name = 'Sheet 2')

In [172]:
# TO read from HTML file.  ALso is web scrapping throug pandas

df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [173]:
type(df)

list

In [178]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [179]:
# TO read from SQL
# The key functions are:

#read_sql_table(table_name, con[, schema, ...])
#Read SQL database table into a DataFrame.
#read_sql_query(sql, con[, index_col, ...])
#Read SQL query into a DataFrame.
#read_sql(sql, con[, index_col, ...])
#Read SQL query or database table into a DataFrame.
#DataFrame.to_sql(name, con[, flavor, ...])
#Write records stored in a DataFrame to a SQL database.

In [180]:
from sqlalchemy import create_engine

In [181]:
engine = create_engine('sqlite:///:memory:')   # create a temprory SQ engine to work on

In [186]:
df = pd.DataFrame(np.random.randn(4,4), columns=['A','B','C','D'])

In [187]:
df

          A         B         C         D
0  0.681209  1.035125 -0.031160  1.939932
1 -1.005187 -0.741790  0.187125 -0.732845
2 -1.382920  1.482495  0.961458 -2.141212
3  0.992573  1.192241 -1.046780  1.292765

In [188]:
df.to_sql('My_sql',engine)

In [192]:
sqldf = pd.read_sql('My_sql', con=engine)

In [193]:
sqldf

   index         A         B         C         D
0      0  0.681209  1.035125 -0.031160  1.939932
1      1 -1.005187 -0.741790  0.187125 -0.732845
2      2 -1.382920  1.482495  0.961458 -2.141212
3      3  0.992573  1.192241 -1.046780  1.292765